from aiogram import Router
from aiogram.filters import Command
from aiogram.types import Message

from app.keyboards.inline import builder

router = Router()


help_text = """
❓ Справка по управлению задачами \n
Здесь собраны все команды и подсказки, которые помогут тебе эффективно использовать бота.\n
📝 Как добавлять задачи:\n
Просто напиши текст дела в чат. Ты можешь сразу указать время, и я создам напоминание.
Примеры:\n
• «Позвонить коллеге» (задача без времени)
• «Сходить в спортзал сегодня в 19:30»
• «Купить подарок маме 15 мая в 12:00»\n
📋 Основные команды:\n
/start — Перезапустить бота и открыть главное меню
/list — Показать все твои активные задачи на сегодня
/done — Быстро отметить задачу как выполненную
/categories — Управление списками (Работа, Дом, Учеба)
/settings — Настройка часового пояса и уведомлений
/help — Показать это справочное сообщение\n
💡 Лайфхак: Ты можешь пересылать мне сообщения из других чатов и каналов — я автоматически превращу их в твои задачи!
Если у тебя возникли проблемы или есть предложение по улучшению бота, напиши в поддержку: @твой_ник_поддержки
"""

@router.message(Command("help"))
async def custom_handler(message: Message):
    await message.answer(help_text, reply_markup = builder.as_markup())
